Revit API Introduction Labs
LabUtils.GetSharedParamsFile Method
 Helper to get shared parameters file.
 Namespace: Labs
 Assembly: labs (in labs.dll) Version: 3.0.0.1 (3.0.0.1)
Syntax
C#
public static DefinitionFile GetSharedParamsFile(
	Application app
)
Visual Basic (Declaration)
Public Shared Function GetSharedParamsFile ( _
	app As Application _
) As DefinitionFile
Visual C++
public:
static DefinitionFile^ GetSharedParamsFile(
	Application^ app
)
Parameters
app
Type: Application
See Also
LabUtils Class
Labs Namespace